In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Create a series
by passing a list of values, letting pandas create a default integer index

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

# Create a DataFrame
by passing a NumPy array, with a datetime index and labeled columns

In [3]:
dates = pd.date_range('20180101', periods=6)
dates

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [5]:
df

                   A         B         C         D
2018-01-01 -0.024552 -0.094404  0.028681  0.049011
2018-01-02 -0.870259  1.557037 -0.409054 -1.595939
2018-01-03  0.082340  0.343438 -0.416118 -0.369772
2018-01-04  0.763795 -0.689121  0.715344 -0.047795
2018-01-05  2.106262 -1.312712  0.262541  0.620412
2018-01-06  0.006163 -0.223981  1.201071  1.136363

# Create a DataFrame
by passing a dict of objects that can be converted to series-like

In [6]:
df2 = pd.DataFrame(
    {
        'A': 1,
        'B': pd.Timestamp('20180102'),
        'C': pd.Series(1, index=list(range(4)), dtype='float32'),
        'D': np.array([3] * 4, dtype='int32'),
        'E': pd.Categorical(['test', 'train', 'test', 'train']),
        'F': 'foo',
    }
)
df2

   A          B    C  D      E    F
0  1 2018-01-02  1.0  3   test  foo
1  1 2018-01-02  1.0  3  train  foo
2  1 2018-01-02  1.0  3   test  foo
3  1 2018-01-02  1.0  3  train  foo

The columns have different dtypes

In [7]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# Viewing Data

In [8]:
df.head()

                   A         B         C         D
2018-01-01 -0.024552 -0.094404  0.028681  0.049011
2018-01-02 -0.870259  1.557037 -0.409054 -1.595939
2018-01-03  0.082340  0.343438 -0.416118 -0.369772
2018-01-04  0.763795 -0.689121  0.715344 -0.047795
2018-01-05  2.106262 -1.312712  0.262541  0.620412

In [9]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.343958 -0.069957  0.230411 -0.034620
std    1.007437  0.976742  0.639685  0.933540
min   -0.870259 -1.312712 -0.416118 -1.595939
25%   -0.016873 -0.572836 -0.299620 -0.289278
50%    0.044252 -0.159192  0.145611  0.000608
75%    0.593431  0.233978  0.602143  0.477562
max    2.106262  1.557037  1.201071  1.136363

Transposing data

In [10]:
df.T

   2018-01-01  2018-01-02  2018-01-03  2018-01-04  2018-01-05  2018-01-06
A   -0.024552   -0.870259    0.082340    0.763795    2.106262    0.006163
B   -0.094404    1.557037    0.343438   -0.689121   -1.312712   -0.223981
C    0.028681   -0.409054   -0.416118    0.715344    0.262541    1.201071
D    0.049011   -1.595939   -0.369772   -0.047795    0.620412    1.136363

Sorting by an axis

In [11]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2018-01-01  0.049011  0.028681 -0.094404 -0.024552
2018-01-02 -1.595939 -0.409054  1.557037 -0.870259
2018-01-03 -0.369772 -0.416118  0.343438  0.082340
2018-01-04 -0.047795  0.715344 -0.689121  0.763795
2018-01-05  0.620412  0.262541 -1.312712  2.106262
2018-01-06  1.136363  1.201071 -0.223981  0.006163

Sorting by values

In [12]:
df.sort_values(by='B')

                   A         B         C         D
2018-01-05  2.106262 -1.312712  0.262541  0.620412
2018-01-04  0.763795 -0.689121  0.715344 -0.047795
2018-01-06  0.006163 -0.223981  1.201071  1.136363
2018-01-01 -0.024552 -0.094404  0.028681  0.049011
2018-01-03  0.082340  0.343438 -0.416118 -0.369772
2018-01-02 -0.870259  1.557037 -0.409054 -1.595939

# Selection

### Getting

In [13]:
df['A']

2018-01-01   -0.024552
2018-01-02   -0.870259
2018-01-03    0.082340
2018-01-04    0.763795
2018-01-05    2.106262
2018-01-06    0.006163
Freq: D, Name: A, dtype: float64

In [14]:
df[0:3]

                   A         B         C         D
2018-01-01 -0.024552 -0.094404  0.028681  0.049011
2018-01-02 -0.870259  1.557037 -0.409054 -1.595939
2018-01-03  0.082340  0.343438 -0.416118 -0.369772

In [15]:
df['20180102': '20180104']

                   A         B         C         D
2018-01-02 -0.870259  1.557037 -0.409054 -1.595939
2018-01-03  0.082340  0.343438 -0.416118 -0.369772
2018-01-04  0.763795 -0.689121  0.715344 -0.047795

### Selection by Label

In [16]:
df.loc[dates[0]]

A   -0.024552
B   -0.094404
C    0.028681
D    0.049011
Name: 2018-01-01 00:00:00, dtype: float64

Selecting on a multi-axis by label

In [17]:
df.loc[:, ['A', 'B']]

                   A         B
2018-01-01 -0.024552 -0.094404
2018-01-02 -0.870259  1.557037
2018-01-03  0.082340  0.343438
2018-01-04  0.763795 -0.689121
2018-01-05  2.106262 -1.312712
2018-01-06  0.006163 -0.223981

Showing label slicing, both endpoints are included

In [18]:
df.loc['20180102': '20180104', ['A', 'B']]

                   A         B
2018-01-02 -0.870259  1.557037
2018-01-03  0.082340  0.343438
2018-01-04  0.763795 -0.689121

For getting a scalar value

In [19]:
df.loc[dates[0], 'A']

-0.024552232721144217

For getting fast access to a scalar (equivalent to the prior method)

In [20]:
df.at[dates[0], 'A']

-0.024552232721144217

### Selection by Position

In [21]:
df.iloc[3]

A    0.763795
B   -0.689121
C    0.715344
D   -0.047795
Name: 2018-01-04 00:00:00, dtype: float64

By integer slices, acting similar to python

In [22]:
df.iloc[3:5, 0:2]

                   A         B
2018-01-04  0.763795 -0.689121
2018-01-05  2.106262 -1.312712

By lists of integer position locations

In [23]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2018-01-02 -0.870259 -0.409054
2018-01-03  0.082340 -0.416118
2018-01-05  2.106262  0.262541

For getting a value explicitly:

In [24]:
df.iloc[1, 1]

1.5570368305011917

# Boolean Indexing

Using a single column’s values to select data.

In [25]:
df[df.B > 0]

                   A         B         C         D
2018-01-02 -0.870259  1.557037 -0.409054 -1.595939
2018-01-03  0.082340  0.343438 -0.416118 -0.369772

Selecting values from a DataFrame where a boolean condition is met

In [26]:
df[df > 0]

                   A         B         C         D
2018-01-01       NaN       NaN  0.028681  0.049011
2018-01-02       NaN  1.557037       NaN       NaN
2018-01-03  0.082340  0.343438       NaN       NaN
2018-01-04  0.763795       NaN  0.715344       NaN
2018-01-05  2.106262       NaN  0.262541  0.620412
2018-01-06  0.006163       NaN  1.201071  1.136363

In [27]:
df2 = df.copy()
df2['E'] = 'one one two three four three'.split()
df2

                   A         B         C         D      E
2018-01-01 -0.024552 -0.094404  0.028681  0.049011    one
2018-01-02 -0.870259  1.557037 -0.409054 -1.595939    one
2018-01-03  0.082340  0.343438 -0.416118 -0.369772    two
2018-01-04  0.763795 -0.689121  0.715344 -0.047795  three
2018-01-05  2.106262 -1.312712  0.262541  0.620412   four
2018-01-06  0.006163 -0.223981  1.201071  1.136363  three

Using the `isin()` method for filtering

In [28]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2018-01-03  0.082340  0.343438 -0.416118 -0.369772   two
2018-01-05  2.106262 -1.312712  0.262541  0.620412  four

# Setting

Setting a new column automatically aligns the data by the indexes

In [29]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20180102', periods=6))
s1

2018-01-02    1
2018-01-03    2
2018-01-04    3
2018-01-05    4
2018-01-06    5
2018-01-07    6
Freq: D, dtype: int64

In [30]:
df['F'] = s1
df

                   A         B         C         D    F
2018-01-01 -0.024552 -0.094404  0.028681  0.049011  NaN
2018-01-02 -0.870259  1.557037 -0.409054 -1.595939  1.0
2018-01-03  0.082340  0.343438 -0.416118 -0.369772  2.0
2018-01-04  0.763795 -0.689121  0.715344 -0.047795  3.0
2018-01-05  2.106262 -1.312712  0.262541  0.620412  4.0
2018-01-06  0.006163 -0.223981  1.201071  1.136363  5.0

Setting values by label

In [31]:
df.at[dates[0], 'A'] = 0

Set values by position

In [32]:
df.iat[0, 1] = 0

In [33]:
df

                   A         B         C         D    F
2018-01-01  0.000000  0.000000  0.028681  0.049011  NaN
2018-01-02 -0.870259  1.557037 -0.409054 -1.595939  1.0
2018-01-03  0.082340  0.343438 -0.416118 -0.369772  2.0
2018-01-04  0.763795 -0.689121  0.715344 -0.047795  3.0
2018-01-05  2.106262 -1.312712  0.262541  0.620412  4.0
2018-01-06  0.006163 -0.223981  1.201071  1.136363  5.0

# Stats

In [34]:
df.mean()

A    0.348050
B   -0.054223
C    0.230411
D   -0.034620
F    3.000000
dtype: float64

Same operation on the other axis:

In [35]:
df.mean(1)

2018-01-01    0.019423
2018-01-02   -0.063643
2018-01-03    0.327977
2018-01-04    0.748445
2018-01-05    1.135301
2018-01-06    1.423923
Freq: D, dtype: float64

# Append

Append rows to a dataframe

In [36]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0  0.171616  0.212225  0.180022  0.327623
1  0.393448  0.416267  0.900874  0.251488
2 -0.347879  1.579302 -0.858671  1.107209
3  0.389492  0.665526 -1.999092  0.182480
4  0.994472  1.240192  1.135031  2.786568
5 -0.678639 -0.015970  0.317077 -1.005424
6  0.420696 -1.303461  0.432764  0.246793
7  0.239595 -0.182363 -0.142390 -0.502657

In [37]:
s = df.iloc[3]

In [38]:
s

A    0.389492
B    0.665526
C   -1.999092
D    0.182480
Name: 3, dtype: float64

In [39]:
df.append(s, ignore_index=True)

          A         B         C         D
0  0.171616  0.212225  0.180022  0.327623
1  0.393448  0.416267  0.900874  0.251488
2 -0.347879  1.579302 -0.858671  1.107209
3  0.389492  0.665526 -1.999092  0.182480
4  0.994472  1.240192  1.135031  2.786568
5 -0.678639 -0.015970  0.317077 -1.005424
6  0.420696 -1.303461  0.432764  0.246793
7  0.239595 -0.182363 -0.142390 -0.502657
8  0.389492  0.665526 -1.999092  0.182480

# Grouping

In [40]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                           'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})

In [41]:
df

     A      B         C         D
0  foo    one -0.006635  2.179904
1  bar    one  0.616389  1.201422
2  foo    two  0.879543  1.091245
3  bar  three  2.318167 -0.034935
4  foo    two  0.570316  0.593523
5  bar    two  1.614244  0.665999
6  foo    one -0.512013 -0.178963
7  foo  three -0.629692  1.404041

Grouping and then applying the sum() function to the resulting groups.

In [42]:
df.groupby('A').sum()

            C         D
A
bar  4.548800  1.832486
foo  0.301518  5.089749

Grouping by multiple columns forms a hierarchical index, and again we can apply the sum function.

In [43]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.616389  1.201422
    three  2.318167 -0.034935
    two    1.614244  0.665999
foo one   -0.518648  2.000941
    three -0.629692  1.404041
    two    1.449858  1.684768

# Reshaping

In [44]:
tuples = list(zip(*[
            ['bar', 'bar', 'baz', 'baz',
             'foo', 'foo', 'qux', 'qux'],
            ['one', 'two', 'one', 'two',
             'one', 'two', 'one', 'two']]))

In [45]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [46]:
index = pd.MultiIndex.from_tuples(tuples, names='first second'.split())

In [47]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns='A B'.split())

In [48]:
df

                     A         B
first second
bar   one     0.772259 -0.123225
      two     0.659886  0.741015
baz   one    -1.575334 -0.348230
      two    -0.175876  0.662087
foo   one    -2.059548  1.578819
      two    -0.477896 -0.217427
qux   one     0.484540 -1.356048
      two    -0.907511 -0.427125

In [49]:
df2 = df[:4]
df2

                     A         B
first second
bar   one     0.772259 -0.123225
      two     0.659886  0.741015
baz   one    -1.575334 -0.348230
      two    -0.175876  0.662087

In [50]:
stacked = df2.stack()
stacked

first  second
bar    one     A    0.772259
               B   -0.123225
       two     A    0.659886
               B    0.741015
baz    one     A   -1.575334
               B   -0.348230
       two     A   -0.175876
               B    0.662087
dtype: float64

In [51]:
stacked.unstack()

                     A         B
first second
bar   one     0.772259 -0.123225
      two     0.659886  0.741015
baz   one    -1.575334 -0.348230
      two    -0.175876  0.662087

In [52]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.772259 -1.575334
       B -0.123225 -0.348230
two    A  0.659886 -0.175876
       B  0.741015  0.662087

In [53]:
stacked.unstack(1)

second        one       two
first
bar   A  0.772259  0.659886
      B -0.123225  0.741015
baz   A -1.575334 -0.175876
      B -0.348230  0.662087

In [54]:
stacked.unstack(2)

                     A         B
first second
bar   one     0.772259 -0.123225
      two     0.659886  0.741015
baz   one    -1.575334 -0.348230
      two    -0.175876  0.662087

# Categoricals

In [55]:
df = pd.DataFrame({'id': [1, 2, 3, 4, 5, 6], 'raw_grade': 'a b b a a e'.split()})

In [56]:
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [57]:
df['grade'] = df['raw_grade'].astype('category')

In [58]:
df['grade']

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [59]:
df['grade'].cat.categories = ['very good', 'good', 'very bad']

In [60]:
df['grade']

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): [very good, good, very bad]

In [61]:
df.sort_values(by='grade')

   id raw_grade      grade
0   1         a  very good
3   4         a  very good
4   5         a  very good
1   2         b       good
2   3         b       good
5   6         e   very bad

In [62]:
df.groupby('grade').size()

grade
very good    3
good         2
very bad     1
dtype: int64